-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Oct 18, 2025 at 06:21 AM
-- Server version: 5.7.34
-- PHP Version: 8.3.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `budget_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `budgets`
--

CREATE TABLE `budgets` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) DEFAULT NULL,
  `code_id` int(11) DEFAULT NULL,
  `adding_date` datetime DEFAULT CURRENT_TIMESTAMP,
  `year` int(11) DEFAULT NULL,
  `yearly_amount` decimal(15,2) DEFAULT '0.00',
  `month` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `ec_month` tinyint(3) UNSIGNED DEFAULT NULL,
  `monthly_amount` decimal(15,2) DEFAULT '0.00',
  `quarter` int(11) DEFAULT NULL,
  `remaining_yearly` decimal(15,2) DEFAULT '0.00',
  `remaining_monthly` decimal(15,2) DEFAULT '0.00',
  `remaining_quarterly` decimal(15,2) DEFAULT '0.00',
  `is_yearly` tinyint(1) DEFAULT '0',
  `parent_id` int(11) DEFAULT NULL,
  `allocated_amount` decimal(15,2) DEFAULT '0.00',
  `spent_amount` decimal(15,2) DEFAULT '0.00',
  `budget_type` enum('governmental','program') COLLATE utf8mb4_unicode_ci DEFAULT 'governmental',
  `program_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `activity_based` tinyint(1) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `budgets`
--

INSERT INTO `budgets` (`id`, `owner_id`, `code_id`, `adding_date`, `year`, `yearly_amount`, `month`, `ec_month`, `monthly_amount`, `quarter`, `remaining_yearly`, `remaining_monthly`, `remaining_quarterly`, `is_yearly`, `parent_id`, `allocated_amount`, `spent_amount`, `budget_type`, `program_name`, `activity_based`) VALUES
(1, 8, 6, '2025-10-15 00:00:00', 2017, 100000.00, '', NULL, 0.00, 0, 83626.82, 0.00, 0.00, 1, NULL, 0.00, 0.00, 'governmental', NULL, 0),
(2, 8, 6, '2025-10-15 00:00:00', 2017, 0.00, 'Meskerem', 1, 10000.00, 1, 90000.00, 10000.00, 30000.00, 0, NULL, 0.00, 0.00, 'governmental', NULL, 0),
(3, 5, 6, '2025-10-15 00:00:00', 2017, 100000.00, '', NULL, 0.00, 0, 90000.00, 0.00, 0.00, 1, NULL, 0.00, 0.00, 'governmental', NULL, 0),
(4, 5, 6, '2025-10-15 00:00:00', 2017, 0.00, 'Meskerem', 1, 10000.00, 1, 90000.00, 10000.00, 30000.00, 0, NULL, 0.00, 0.00, 'governmental', NULL, 0),
(5, 6, 6, '2025-10-17 00:00:00', 2017, 150000.00, '', NULL, 0.00, 0, 135000.00, 0.00, 0.00, 1, NULL, 0.00, 0.00, 'governmental', NULL, 0),
(6, 6, 6, '2025-10-17 00:00:00', 2017, 0.00, 'Meskerem', 1, 15000.00, 1, 135000.00, 15000.00, 45000.00, 0, NULL, 0.00, 0.00, 'governmental', NULL, 0),
(7, 6, 5, '2025-10-17 00:00:00', 2017, 150000.00, '', NULL, 0.00, 0, 130000.00, 0.00, 0.00, 1, NULL, 0.00, 0.00, 'governmental', NULL, 0),
(8, 6, 5, '2025-10-17 00:00:00', 2017, 0.00, 'Meskerem', 1, 20000.00, 1, 130000.00, 20000.00, 60000.00, 0, NULL, 0.00, 0.00, 'governmental', NULL, 0),
(9, 36, NULL, '2025-10-17 00:00:00', 2017, 1000000.00, '', NULL, 0.00, 0, 1000000.00, 0.00, 0.00, 1, NULL, 0.00, 0.00, 'program', NULL, 0),
(10, 43, NULL, '2025-10-17 00:00:00', 2017, 1000000.00, '', NULL, 0.00, 0, 1000000.00, 0.00, 0.00, 1, NULL, 0.00, 0.00, 'program', NULL, 0),
(11, 38, NULL, '2025-10-17 00:00:00', 2017, 1000000.00, '', NULL, 0.00, 0, 992377.06, 0.00, 0.00, 1, NULL, 0.00, 0.00, 'program', NULL, 0),
(12, 31, NULL, '2025-10-17 00:00:00', 2017, 1000000.00, '', NULL, 0.00, 0, 1000000.00, 0.00, 0.00, 1, NULL, 0.00, 0.00, 'program', NULL, 0),
(13, 30, NULL, '2025-10-17 00:00:00', 2017, 1000000.00, '', NULL, 0.00, 0, 1000000.00, 0.00, 0.00, 1, NULL, 0.00, 0.00, 'program', NULL, 0),
(14, 32, NULL, '2025-10-17 00:00:00', 2017, 1000000.00, '', NULL, 0.00, 0, 1000000.00, 0.00, 0.00, 1, NULL, 0.00, 0.00, 'program', NULL, 0);

-- --------------------------------------------------------

--
-- Table structure for table `emp_list`
--

CREATE TABLE `emp_list` (
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `salary` decimal(8,2) DEFAULT NULL,
  `name_am` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `taamagoli` varchar(25) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `directorate` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `photo` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `id` int(11) NOT NULL,
  `income_tax` decimal(10,2) DEFAULT '0.00',
  `pension_employee` decimal(10,2) DEFAULT '0.00',
  `pension_company` decimal(10,2) DEFAULT '0.00',
  `net_pay` decimal(10,2) DEFAULT '0.00'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `emp_list`
--

INSERT INTO `emp_list` (`name`, `salary`, `name_am`, `taamagoli`, `directorate`, `photo`, `created_at`, `id`, `income_tax`, `pension_employee`, `pension_company`, `net_pay`) VALUES
('Yaasin Habbib', 14114.16, 'ያሲን ሀቢብ አሀመድ', '341/01/01', '', NULL, '', 1, 0.00, 0.00, 0.00, 0.00),
('Saqid Macammad Ibraahim', 13798.22, 'ሰኢድ መሀመድ ኢ/ም', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 2, 0.00, 0.00, 0.00, 0.00),
('Cuseen Mocammad', 12800.60, 'ሁሴን መሀመድ አህመድ', '341/03/02', 'የክሊኒካል አገልግሎት ዳያሬክቶሬት', NULL, '', 3, 0.00, 0.00, 0.00, 0.00),
('Fatima Acmad Yusuf', 15765.16, 'ፈጢማ አህመድ ዩሱፍ', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 4, 0.00, 0.00, 0.00, 0.00),
('Riim Adam Bidaaru', 14618.80, 'ሪም አደም ቢደሮ', '341/04/18', 'የሥርአተ ምግብ ማስተባበርያ ዳይሬክቶሬት', NULL, '', 5, 0.00, 0.00, 0.00, 0.00),
('Momiina Qabdalla', 13518.26, 'ሞሚና አብደላ ገአስ', '341/05/19', 'የበሽታ መከላከልና መቆጣጠር ዳያሬክቶሬት', NULL, '', 6, 0.00, 0.00, 0.00, 0.00),
('Tasiifaye Balayi Saqid', 14925.60, 'ተስፋየ በላይ ሰይድ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 7, 0.00, 0.00, 0.00, 0.00),
('Amin Qarba Qunxe', 12800.60, 'አሚን አርባ ኡንዴ', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 8, 0.00, 0.00, 0.00, 0.00),
('Amiin Qali Qaasire', 12700.85, 'አሚን አሊ አስሬ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 9, 0.00, 0.00, 0.00, 0.00),
('Macammad Yimam Acmad', 12700.85, 'መሀመድ ይመም አህመድ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 10, 0.00, 0.00, 0.00, 0.00),
('Hawaa Daraasa', 12445.55, 'ሀዋ ደርሳ', '341/03/02', 'የክሊኒካል አገልግሎት ዳያሬክቶሬት', NULL, '', 11, 0.00, 0.00, 0.00, 0.00),
('Racima Naguus', 15765.16, 'ራሂማ ኑጉስ', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 12, 0.00, 0.00, 0.00, 0.00),
('Muusa Qabdu Salic', 12700.85, 'ሙሳ አብዱ ሰልህ', '341/04/18', 'የሥርአተ ምግብ ማስተባበርያ ዳይሬክቶሬት', NULL, '', 13, 0.00, 0.00, 0.00, 0.00),
('Saqada Macammmad', 12445.55, 'ሰአደ መሀመድ', '341/05/19', 'የበሽታ መከላከልና መቆጣጠር ዳያሬክቶሬት', NULL, '', 14, 0.00, 0.00, 0.00, 0.00),
('Daawud Yusuf', 13798.22, 'ደዉድ የሱፍ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 15, 0.00, 0.00, 0.00, 0.00),
('Edrs Darrasa Hodale', 10774.00, 'ኢድሪስ ደረሳ', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 16, 0.00, 0.00, 0.00, 0.00),
('Asiya nuur murrale', 12545.30, 'አስያ ኑር ሚራለ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 17, 0.00, 0.00, 0.00, 0.00),
('Teyba M.d Akkle', 12951.89, 'ጣይባ መሀመድ አክሌ', '341/01/01', '', NULL, '', 18, 0.00, 0.00, 0.00, 0.00),
('Fatuma Endris', 10562.00, 'ፈጡማ እንድርስ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 19, 0.00, 0.00, 0.00, 0.00),
('Acmad Mustafa', 12700.85, 'አህመድ ሙሰጠፋ', '341/03/02', 'የክሊኒካል አገልግሎት ዳያሬክቶሬት', NULL, '', 20, 0.00, 0.00, 0.00, 0.00),
('Gifiti Hawaa Qabdu Cuseen', 14618.80, 'ሀዋ አብዱ ሁሴን', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 21, 0.00, 0.00, 0.00, 0.00),
('Waasiq Saddik', 12800.60, 'ዋስዕ ሰዲቅ መሀመድ', '341/04/18', 'የሥርአተ ምግብ ማስተባበርያ ዳይሬክቶሬት', NULL, '', 22, 0.00, 0.00, 0.00, 0.00),
('Yayyo Sadik Mocammad', 12700.85, 'ያዮ ሠድቅ መሀመድ', '341/05/19', 'የበሽታ መከላከልና መቆጣጠር ዳያሬክቶሬት', NULL, '', 23, 0.00, 0.00, 0.00, 0.00),
('Sultan Qabdella', 13798.22, 'ሱልጣን አብደላ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 24, 0.00, 0.00, 0.00, 0.00),
('Macammad Saqid Meqe', 10774.00, 'መሀመድ ሰኢድ ሜእ', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 25, 0.00, 0.00, 0.00, 0.00),
('Wittika Noore Wittika', 13218.83, 'ዊቲካ ኖሬ ዊቲካ', '341/01/01', '', NULL, '', 26, 0.00, 0.00, 0.00, 0.00),
('Taahir Cusen', 10774.00, 'ጣሂር ሁሴን', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 27, 0.00, 0.00, 0.00, 0.00),
('Samira Yimam', 8737.00, 'ሰሚራ ይማም', '341/03/02', 'የክሊኒካል አገልግሎት ዳያሬክቶሬት', NULL, '', 28, 0.00, 0.00, 0.00, 0.00),
('Qali Qabdussamad Wassqi', 14925.60, 'አሊ አብዱሰመድ ዋሰእ', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 29, 0.00, 0.00, 0.00, 0.00),
('cabib Casaan', 11694.26, 'ሀቢብ አሰን', '341/04/18', 'የሥርአተ ምግብ ማስተባበርያ ዳይሬክቶሬት', NULL, '', 30, 0.00, 0.00, 0.00, 0.00),
('Qeysa Qabdalla Shaami', 12445.55, 'ኤይሳ አብደላ', '341/05/19', 'የበሽታ መከላከልና መቆጣጠር ዳያሬክቶሬት', NULL, '', 31, 0.00, 0.00, 0.00, 0.00),
('Nuru Macammad Dima', 12700.85, 'ኑሩ መሀመድ ዲማ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 32, 0.00, 0.00, 0.00, 0.00),
('Acmad Saalci', 10774.00, 'አህመድ ሳሊሂ', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 33, 0.00, 0.00, 0.00, 0.00),
('Maymuna Muusa Qali', 10562.00, 'መይሙና ሙሳ አሊ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 34, 0.00, 0.00, 0.00, 0.00),
('Xr Cumed Qarsoyta Koxxali', 13218.83, 'ዶ/ር ሁመድ አርሶይታ ኮደሊ', '341/01/01', '', NULL, '', 35, 0.00, 0.00, 0.00, 0.00),
('Qali Macammad Qumar', 9348.17, 'አሊ መሀመድ ዑመር', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 36, 0.00, 0.00, 0.00, 0.00),
('Shimaalis Awweke', 10774.00, 'ሽማልስ አዉቄ', '341/03/02', 'የክሊኒካል አገልግሎት ዳያሬክቶሬት', NULL, '', 37, 0.00, 0.00, 0.00, 0.00),
('Acmad Qa/kqaadir Bareket', 12700.85, 'አህመድ አ/ቃድር በረከት', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 38, 0.00, 0.00, 0.00, 0.00),
('Cabib Saqid Macammad', 10774.00, 'ሀቢብ ሰኢድ መሀመድ', '341/04/18', 'የሥርአተ ምግብ ማስተባበርያ ዳይሬክቶሬት', NULL, '', 39, 0.00, 0.00, 0.00, 0.00),
('Acmed Qali Cabib', 12700.85, 'አህመድ አሊ ሀቢብ', '341/05/19', 'የበሽታ መከላከልና መቆጣጠር ዳያሬክቶሬት', NULL, '', 40, 0.00, 0.00, 0.00, 0.00),
('Ababawu Walixe', 12700.85, 'አበባዉ ወልዴ ገ/ሚሀኤል', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 41, 0.00, 0.00, 0.00, 0.00),
('Kadiiiga Macammad Muusa', 10562.00, 'ከድጃ መሀመድ ሙሳ', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 42, 0.00, 0.00, 0.00, 0.00),
('fatuma Abubakar Sadik', 10562.00, 'ፋጡማ አቡበከር ሳዲቅ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 43, 0.00, 0.00, 0.00, 0.00),
('kayrya Esmaqil', 12951.89, 'ከይረያ እስመእል', '341/01/01', '', NULL, '', 44, 0.00, 0.00, 0.00, 0.00),
('Saqaxa Yiimam', 10562.00, 'ሰአዳ ይማም አሊ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 45, 0.00, 0.00, 0.00, 0.00),
('Nuru Qali Cumad', 10774.00, 'ኑሩ አሊ ሁመድ', '341/03/02', 'የክሊኒካል አገልግሎት ዳያሬክቶሬት', NULL, '', 46, 0.00, 0.00, 0.00, 0.00),
('Macammad Qabdukadir M/d', 12700.85, 'መሀመድ አብዱቃድር', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 47, 0.00, 0.00, 0.00, 0.00),
('Sahis Jamaal qali', 10774.00, 'ሳህስ ጀማል አሊ', '341/04/18', 'የሥርአተ ምግብ ማስተባበርያ ዳይሬክቶሬት', NULL, '', 48, 0.00, 0.00, 0.00, 0.00),
('Khadir Adam Darasa', 10774.00, 'ከድር አደም', '341/05/19', 'የበሽታ መከላከልና መቆጣጠር ዳያሬክቶሬት', NULL, '', 49, 0.00, 0.00, 0.00, 0.00),
('Qisee Xogaa M/d', 11694.26, 'ኢሴ ዶጋ መሀመድ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 50, 0.00, 0.00, 0.00, 0.00),
('Naser Garamewu', 10774.00, 'ናስር ገረመዉ', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 51, 0.00, 0.00, 0.00, 0.00),
('Qali Cammadu Qali', 9925.59, 'አሊ ሀመዱ አሊ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 52, 0.00, 0.00, 0.00, 0.00),
('Macammad Tabbasa', 12607.40, 'መሀመድ ተብሳ', '341/01/01', '', NULL, '', 53, 0.00, 0.00, 0.00, 0.00),
('Ricaana Ebraahim Acmad', 9732.69, 'ሪሃና እብራሂም አህመድ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 54, 0.00, 0.00, 0.00, 0.00),
('Qabdalla Cuseen Acmad', 10774.00, 'አብደላ ሁሴን አህመድ', '341/03/02', 'የክሊኒካል አገልግሎት ዳያሬክቶሬት', NULL, '', 55, 0.00, 0.00, 0.00, 0.00),
('Mustafa Qiise Macammad', 12700.85, 'ሙስጠፋ ኢሴ መሀመድ', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 56, 0.00, 0.00, 0.00, 0.00),
('Ibrahim mahmud Qabdalla', 10774.00, 'ኢብራሂም ማህሙድ አብደላ', '341/04/18', 'የሥርአተ ምግብ ማስተባበርያ ዳይሬክቶሬት', NULL, '', 57, 0.00, 0.00, 0.00, 0.00),
('Macammad Qali Sokale', 10774.00, 'መሀመድ አሊ ሶከሌ', '341/05/19', 'የበሽታ መከላከልና መቆጣጠር ዳያሬክቶሬት', NULL, '', 58, 0.00, 0.00, 0.00, 0.00),
('Birhanu Mulu', 11694.26, 'ብርሃኑ ሙሉ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 59, 0.00, 0.00, 0.00, 0.00),
('khadir Macammad Saqid', 10774.00, 'ከድር መሀመድ ሰኢድ', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 60, 0.00, 0.00, 0.00, 0.00),
('Tafari Matyos', 9925.59, 'ተፋሪ መትዮስ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 61, 0.00, 0.00, 0.00, 0.00),
('Qaddilbar Qali Ibraahim', 12800.60, 'አድሊበራ አሊ ኢ/ም', '341/01/01', '', NULL, '', 62, 0.00, 0.00, 0.00, 0.00),
('Qali Cummad Qali', 9925.59, 'አሊ ሁመድ አሊ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 63, 0.00, 0.00, 0.00, 0.00),
('Qali Cusen Ibrahim', 10774.00, 'አሊ ሁሴን እብራሂም', '341/03/02', 'የክሊኒካል አገልግሎት ዳያሬክቶሬት', NULL, '', 64, 0.00, 0.00, 0.00, 0.00),
('Macammad Idris Burahan', 10774.00, 'መሀመድ ኢንድሪስ ቡርሃን', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 65, 0.00, 0.00, 0.00, 0.00),
('Macammad Qabdu', 9362.27, 'መሀመድ አብዱ', '341/04/18', 'የሥርአተ ምግብ ማስተባበርያ ዳይሬክቶሬት', NULL, '', 66, 0.00, 0.00, 0.00, 0.00),
('Saqaada Qali Abubakar', 10562.00, 'ሰአዳ አሊ', '341/05/19', 'የበሽታ መከላከልና መቆጣጠር ዳያሬክቶሬት', NULL, '', 67, 0.00, 0.00, 0.00, 0.00),
('Yasin Salic M/d', 11694.26, 'ያሲን ሳሊህ መሀመድ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 68, 0.00, 0.00, 0.00, 0.00),
('Masarat Macammad', 10562.00, 'መሠረት መሀመድ አሊ', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 69, 0.00, 0.00, 0.00, 0.00),
('Yunus Macammad Egacle', 9362.27, 'ዩኑስ መሀመድ ኢገህሌ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 70, 0.00, 0.00, 0.00, 0.00),
('Ibraahim Macammad', 12800.60, 'ኢብራሂም መሀመድ መሄ', '341/01/01', '', NULL, '', 71, 0.00, 0.00, 0.00, 0.00),
('Macammad Saqid Adam', 9362.27, 'መሀመድ ሰኢድ አደም', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 72, 0.00, 0.00, 0.00, 0.00),
('Qali Esmaqil Qali', 8839.46, 'አሊ እስማዕል አሊ', '341/03/02', 'የክሊኒካል አገልግሎት ዳያሬክቶሬት', NULL, '', 73, 0.00, 0.00, 0.00, 0.00),
('Wegris Hamedu', 10774.00, 'ወግሪስ ሃመዱ', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 74, 0.00, 0.00, 0.00, 0.00),
('Rokiya Macammad Cumad', 6414.72, 'ሮኪያ መሀመድ ሁመድ', '341/04/18', 'የሥርአተ ምግብ ማስተባበርያ ዳይሬክቶሬት', NULL, '', 75, 0.00, 0.00, 0.00, 0.00),
('Musa Qali Casan', 10774.00, 'ሙሣ አሊ', '341/05/19', 'የበሽታ መከላከልና መቆጣጠር ዳያሬክቶሬት', NULL, '', 76, 0.00, 0.00, 0.00, 0.00),
('Fatuma Awwal Wagris', 11461.58, 'ፈጡማ አዉል', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 77, 0.00, 0.00, 0.00, 0.00),
('Lubaba Macammad Awwal', 9732.69, 'ሉበባ መሀመድ አዉል', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 78, 0.00, 0.00, 0.00, 0.00),
('Saqid Makin Adam', 9362.27, 'ሰኢድ መኪን', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 79, 0.00, 0.00, 0.00, 0.00),
('Salic Luqugud Adam', 12800.60, 'ሷሊህ ሉኡጉድ አደም', '341/01/01', '', NULL, '', 80, 0.00, 0.00, 0.00, 0.00),
('Momiina Casaan Endiris', 9181.33, 'ሞሚና ሀሰን እድርስ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 81, 0.00, 0.00, 0.00, 0.00),
('Qali Macammad Tayb', 8839.46, 'አሊ መሀመድ ጠይብ', '341/03/02', 'የክሊኒካል አገልግሎት ዳያሬክቶሬት', NULL, '', 82, 0.00, 0.00, 0.00, 0.00),
('Casan Macammad A.d', 9925.59, 'ሀሰን መሀመድ አህመድ', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 83, 0.00, 0.00, 0.00, 0.00),
('Zahra Cammadu Qadumane', 10562.00, 'ዘህራ ሀመዱ አዱማኔ', '341/05/19', 'የበሽታ መከላከልና መቆጣጠር ዳያሬክቶሬት', NULL, '', 84, 0.00, 0.00, 0.00, 0.00),
('Adduniya Sadik', 11461.58, 'አዱኒያ ሰዲቅ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 85, 0.00, 0.00, 0.00, 0.00),
('Cumad Cassan', 9925.59, 'ሁመድ ሀሰን', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 86, 0.00, 0.00, 0.00, 0.00),
('Qali Macammad Wale', 9362.27, 'አሊ መሀመድ ዋሌ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 87, 0.00, 0.00, 0.00, 0.00),
('Qali Qabdalla Qali', 23170.00, 'አሊ አብደላ አሊ', '341/01/01', 'የኢንፎርሜሽን ኮሙኒኬሽን ቴክኖሎጂ ዳይሬክቶሬት', NULL, '', 88, 0.00, 0.00, 0.00, 0.00),
('Fatuma Awwal Wittika', 8669.98, 'ፋጡማ አዉል ዊትካ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 89, 0.00, 0.00, 0.00, 0.00),
('Macammad Adam', 8345.56, 'መሀመድ አደም', '341/03/02', 'የክሊኒካል አገልግሎት ዳያሬክቶሬት', NULL, '', 90, 0.00, 0.00, 0.00, 0.00),
('Awwal Guddale Qunxe', 9925.59, 'አዉል ጉደሌ ኡንዴ', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 91, 0.00, 0.00, 0.00, 0.00),
('Siraj Mecammed', 7529.17, 'ሲራጅ መሀመድ', '341/05/19', 'የበሽታ መከላከልና መቆጣጠር ዳያሬክቶሬት', NULL, '', 92, 0.00, 0.00, 0.00, 0.00),
('Acmad Qabdu Barqo', 11694.26, 'አህመድ አብዱ በርኦ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 93, 0.00, 0.00, 0.00, 0.00),
('Qali Zeynu Qarba', 6147.39, 'አሊ ዜይኑ', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 94, 0.00, 0.00, 0.00, 0.00),
('Macammad Nuur Edirid', 9362.27, 'መሀመድኑር እድርስ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 95, 0.00, 0.00, 0.00, 0.00),
('Bileeni Macammad Dawud', 12445.55, 'ቢሌኒ መሀመድ ደዉድ', '341/01/01', '', NULL, '', 96, 0.00, 0.00, 0.00, 0.00),
('Abiti Aliye Guta', 8839.46, 'አብቲ አሊዬ ጉታ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 97, 0.00, 0.00, 0.00, 0.00),
('Mecammed Qabdukader musa', 8326.64, 'መሀመድ አብዱቃድር ሙሣ', '341/03/02', 'የክሊኒካል አገልግሎት ዳያሬክቶሬት', NULL, '', 98, 0.00, 0.00, 0.00, 0.00),
('Cuseen Kaloyta Acmad', 9362.27, 'ሁሴን ከሎይታ አህመድ', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 99, 0.00, 0.00, 0.00, 0.00),
('Sisay Lirea Kutre', 11401.45, 'ሲሳይ ሊሬ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 100, 0.00, 0.00, 0.00, 0.00),
('Yasiin Macammad', 9362.27, 'ያሲን መሀመድ', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 101, 0.00, 0.00, 0.00, 0.00),
('Ebraahim Macammad Sherif', 9362.27, 'አብራሂም መሀመድ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 102, 0.00, 0.00, 0.00, 0.00),
('Abubakar Qarba Qunxe', 21238.00, 'አቡበከር ዓርባ ዑንዴ', 'የፋይናንስ ቡድን መሪ', 'የግዥ፣ ፋይናንስና ንብረት አስተዳደር ዳይሬክቶሬት', NULL, '', 103, 0.00, 0.00, 0.00, 0.00),
('Luuba Qali', 8839.46, 'ሉባ አሊ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 104, 0.00, 0.00, 0.00, 0.00),
('Raxiyet Haylemeyrem', 6832.33, 'ራዲዬት ሀይለመይራም', '341/03/02', 'የክሊኒካል አገልግሎት ዳያሬክቶሬት', NULL, '', 105, 0.00, 0.00, 0.00, 0.00),
('Merkuriy Ebraahim', 9181.33, 'ሜርኩርይ እብራሂም', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 106, 0.00, 0.00, 0.00, 0.00),
('Macammad Qabdalla', 10774.00, 'መሀመድ አብደላ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 107, 0.00, 0.00, 0.00, 0.00),
('Macammad Cuseen Odarra', 9362.27, 'መሀመድ ሁሴን ኦዳራ', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 108, 0.00, 0.00, 0.00, 0.00),
('Madina Muusa Darrasa', 9181.33, 'መድና ሙሳ ደረሳ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 109, 0.00, 0.00, 0.00, 0.00),
('Gumqati Feker Macammed', 12445.55, 'ጁማአቲ ፈኪር መሀመድ', '341/01/01', '', NULL, '', 110, 0.00, 0.00, 0.00, 0.00),
('Mecammed Qabdu', 8839.46, 'መሀመድ አብዱ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 111, 0.00, 0.00, 0.00, 0.00),
('Zahara Awwal Wagres', 9362.27, 'ዘሀራ አወል ወግሪስ', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 112, 0.00, 0.00, 0.00, 0.00),
('Zaynu Qali Cusen', 10774.00, 'ዘይኑ አሊ ሁስን', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 113, 0.00, 0.00, 0.00, 0.00),
('Mulu Tasamma Abtewu', 8669.98, 'ሙሉ ተሰማ አቢተዉ', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 114, 0.00, 0.00, 0.00, 0.00),
('Jamiila Esmaqil M/d', 8669.98, 'ጀሚላ እስማዕል መሀመድ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 115, 0.00, 0.00, 0.00, 0.00),
('Amin Maace Sadik', 12700.85, 'አሚን ማሄ ሳዲቅ', '341/01/01', '', NULL, '', 116, 0.00, 0.00, 0.00, 0.00),
('Qali Casaan', 8345.56, 'አሊ ሀሰን', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 117, 0.00, 0.00, 0.00, 0.00),
('Qali Qabdu', 8839.46, 'አሊ አብዱ', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 118, 0.00, 0.00, 0.00, 0.00),
('Camida Acmad Mcammad', 9732.69, 'ሀሚዳ አህመድ መሀመድ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 119, 0.00, 0.00, 0.00, 0.00),
('Feticya Cuseen Macammad', 8669.98, 'ፋቲሂያ ሁሴን', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 120, 0.00, 0.00, 0.00, 0.00),
('Macammad Qabdalla M/d', 8408.05, 'መሀመድ አብደላ መሀመድ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 121, 0.00, 0.00, 0.00, 0.00),
('Awwal Indrs Qali', 11694.26, 'አዉል እንድሪስ አሊ', '341/01/01', '', NULL, '', 122, 0.00, 0.00, 0.00, 0.00),
('Jilani Qusman Egga', 7863.10, 'ጂላኒ ኡስማን ኢጋ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 123, 0.00, 0.00, 0.00, 0.00),
('Mulu Tafarra Ayale', 7277.32, 'ሙሉ ተፈራ አየለ', '341/04/16', 'የእናቶች ፤ ህፃናት አፍላ ወጣቶች እና አገልግሎት ዳያሬክቶሬት', NULL, '', 124, 0.00, 0.00, 0.00, 0.00),
('Macammad  Adam Qabdalla', 9925.59, 'መሀመድ አደም አብደላ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 125, 0.00, 0.00, 0.00, 0.00),
('Acmad Cabiib Acmad', 8345.56, 'አህመድ ሀቢብ አህመድ', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 126, 0.00, 0.00, 0.00, 0.00),
('Casna Yayyo Macammad', 7714.62, 'ሀስና ያዮ መሀመድ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 127, 0.00, 0.00, 0.00, 0.00),
('Madina Ebraahim', 11461.58, 'መድና ኢብራሂም', '341/01/01', '', NULL, '', 128, 0.00, 0.00, 0.00, 0.00),
('Dawud Acmad Dawud', 7863.10, 'ዳዉድ አህመድ ደዉድ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 129, 0.00, 0.00, 0.00, 0.00),
('Faatuma Muusa qali', 9732.69, 'ፋጡማ ሙሣ አሊ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 130, 0.00, 0.00, 0.00, 0.00),
('Yasin Ibraahim Cammad', 7863.10, 'ያሲን እብራሂም ሀመድ', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 131, 0.00, 0.00, 0.00, 0.00),
('Sofiya Acmad', 6832.33, 'ሶፍያ አህመድ', '341/07/27', 'የጤናና ጤና ነክ አገልግሎቶች ብቃትና ጥራት ማረጋገጥ ዳይሬክቶሬት', NULL, '', 132, 0.00, 0.00, 0.00, 0.00),
('Macammed Umer', 11694.26, 'መዐመድ ኡመር', '341/01/01', '', NULL, '', 133, 0.00, 0.00, 0.00, 0.00),
('Seida Ousman Macammed', 7817.01, 'ሰኢዳ ኡስማን መሀመድ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 134, 0.00, 0.00, 0.00, 0.00),
('Macammad Qabdalla', 9362.58, 'መሀመድ አብደላ መሀመድ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 135, 0.00, 0.00, 0.00, 0.00),
('Khadija Adan', 7277.32, 'ከድጀ አደን', '341/07/25', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '', 136, 0.00, 0.00, 0.00, 0.00),
('Nasir Cusen M/d', 11401.45, 'ነስር ሁሴን መሀመድ', '341/01/01', '', NULL, '', 137, 0.00, 0.00, 0.00, 0.00),
('Hassen Gardo', 7529.17, 'ሃሰን ጋርዶ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 138, 0.00, 0.00, 0.00, 0.00),
('Niqina Dikale Casan', 9525.12, 'ኒዕና ዲነካሌ ሀሰን', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 139, 0.00, 0.00, 0.00, 0.00),
('Qabdu Macammed Cummed', 10774.00, 'አብዱ መሀመድ ሁመድ', '341/01/01', '', NULL, '', 140, 0.00, 0.00, 0.00, 0.00),
('Amina qadu Salih', 7277.32, 'አሚና አብዱ ሳሊህ', '341/02/02', 'የህክምና ግብዓቶች አቅርቦትና የፋርማሲ አገልግሎት ዳይሬክቶሬት', NULL, '', 141, 0.00, 0.00, 0.00, 0.00),
('Meyru Qabdu', 9181.33, 'መይሮ አብዱ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 142, 0.00, 0.00, 0.00, 0.00),
('Mesfin Ferda W/meryem', 9925.59, 'ማስፍን ፍሪዴ ወ/መረይም', '341/01/01', '', NULL, '', 143, 0.00, 0.00, 0.00, 0.00),
('Edrs Darasa Misisso', 9362.27, 'እድርስ ደራሳ ሚሲሶ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 144, 0.00, 0.00, 0.00, 0.00),
('Kadijja Qabdalla A/d', 9181.33, 'ከድጃ አብዳላ አህመድ', '341/01/01', '', NULL, '', 145, 0.00, 0.00, 0.00, 0.00),
('Macammad Qali Acmad', 8839.46, 'መሀመድ አሊ አህመድ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 146, 0.00, 0.00, 0.00, 0.00),
('Qumar Acmad', 9362.27, 'ኡመር አህመድ ሰሊህ', '341/01/01', '', NULL, '', 147, 0.00, 0.00, 0.00, 0.00),
('Cabib Macammad Wasiq', 8839.46, 'ሀቢብ መሀመድ ወሲዕ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 148, 0.00, 0.00, 0.00, 0.00),
('Cuseen Macammad', 9362.27, 'ሁሴን መሀመድ', '341/01/01', '', NULL, '', 149, 0.00, 0.00, 0.00, 0.00),
('Cabib Acmad Qali', 8839.46, 'ሀቢብ አህመድ አሊ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 150, 0.00, 0.00, 0.00, 0.00),
('QabdulliQaziz Yiimar', 9362.27, 'አብዱልአዚዝ ይመር ደዉድ', '341/01/01', '', NULL, '', 151, 0.00, 0.00, 0.00, 0.00),
('zahra Sahle', 8669.98, 'ዘሀራ ሳሃሌ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 152, 0.00, 0.00, 0.00, 0.00),
('Salic Siraj Acmad', 9362.27, 'ሰሊህ ሲራጂ', '341/01/01', '', NULL, '', 153, 0.00, 0.00, 0.00, 0.00),
('Nuru Acmad Mecammed', 8839.46, 'ኑሩ አህመድ መሀመድ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 154, 0.00, 0.00, 0.00, 0.00),
('Kadijja Saqid Qumar', 9181.33, 'ከድጃ ሰኢድ ኡመር', '341/01/01', '', NULL, '', 155, 0.00, 0.00, 0.00, 0.00),
('Macammad Qali Acmad', 8440.81, 'መሀመድ አሊ አህመድ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 156, 0.00, 0.00, 0.00, 0.00),
('Muktar Macammad', 9362.27, 'ሙክተር መሀመድ', '341/01/01', '', NULL, '', 157, 0.00, 0.00, 0.00, 0.00),
('Mecammed Qabdella M', 8408.05, 'መሀመድ አብደላ መሀመድ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 158, 0.00, 0.00, 0.00, 0.00),
('Nuuru M/d Yusuf', 9362.27, 'ኑሩ መሀመድ ዩሱፍ', '341/01/01', '', NULL, '', 159, 0.00, 0.00, 0.00, 0.00),
('Mecammed Celem', 7863.10, 'መሀመድ ሄለም', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 160, 0.00, 0.00, 0.00, 0.00),
('Axanu Asafa', 9181.33, 'አዳኑ አሰፋ ገ/እግዚአብሄር', '341/01/01', '', NULL, '', 161, 0.00, 0.00, 0.00, 0.00),
('Salcaddin Macammad', 7416.12, 'ሳላሃዲን መሀመድ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 162, 0.00, 0.00, 0.00, 0.00),
('Lamlaam Gebru Hayle', 9181.33, 'ለምለም ገብሩ ሀይሌ', '341/01/01', '', NULL, '', 163, 0.00, 0.00, 0.00, 0.00),
('Malika Macammed Awwal', 6546.75, 'ማሊካ መሀመድ አወል', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 164, 0.00, 0.00, 0.00, 0.00),
('Kedja Camid Acmed', 9181.33, 'ከድጃ ሃሚድ አህመድ', '341/01/01', '', NULL, '', 165, 0.00, 0.00, 0.00, 0.00),
('Fatuma Qali', 6535.88, 'ፋጡማ አሊ', '341/06/17', 'የማህበረሰበ ተሳትፎና የመጀመርያ ደረጃ ጤና እንክብካቤ ዳይሬክቶሬት', NULL, '', 166, 0.00, 0.00, 0.00, 0.00),
('Bilaho Qumar Cammadu', 8669.98, 'ቢላሆ ኡመር ሀመዱ', '341/01/01', '', NULL, '', 167, 0.00, 0.00, 0.00, 0.00),
('Wasihun Siisay', 6872.46, 'ወስሁን ሲሳይ', '341/01/01', '', NULL, '', 168, 0.00, 0.00, 0.00, 0.00),
('Abaate Darige', 8839.46, 'አበተ ደርጌ ጎቸዬ', '341/01/01', '', NULL, '', 169, 0.00, 0.00, 0.00, 0.00),
('Qali Macammad', 8839.46, 'አሊ መሀመድ', '341/01/01', '', NULL, '', 170, 0.00, 0.00, 0.00, 0.00),
('Asiiya Macammad Taahiro', 8669.98, 'አሲያ መሀመድ ጣሂሮ', '341/01/01', '', NULL, '', 171, 0.00, 0.00, 0.00, 0.00),
('Momina Muusa M/d', 8669.98, 'ሞሚና ሙሳ መሀመድ', '341/01/01', '', NULL, '', 172, 0.00, 0.00, 0.00, 0.00),
('Nuuriya Maace Qali', 8669.98, 'ኑሪያ ማሄ አሊ', '341/01/01', '', NULL, '', 173, 0.00, 0.00, 0.00, 0.00),
('Calima Lakiqo Konte', 8669.98, 'ሀሊማ ለኦይታ ኮነቴ', '341/01/01', '', NULL, '', 174, 0.00, 0.00, 0.00, 0.00),
('Naqima Qali Yimar', 8669.98, 'ነኢማ አሊ', '341/01/01', '', NULL, '', 175, 0.00, 0.00, 0.00, 0.00),
('Rabiqa Saqid Macammad', 8669.98, 'ራቢኣ ሰኢድ መሀመድ', '341/01/01', '', NULL, '', 176, 0.00, 0.00, 0.00, 0.00),
('Darusalaam Cuseen Casan', 8669.98, 'ዳሩሰላም ሁሴን ሀሰን', '341/01/01', '', NULL, '', 177, 0.00, 0.00, 0.00, 0.00),
('Saqad Seqid Amin', 8839.46, 'ሳዓድ ሰኢድ አሚን', '341/01/01', '', NULL, '', 178, 0.00, 0.00, 0.00, 0.00),
('Lemlam Tafarra', 8669.98, 'ለምለም ተፋራ', '341/01/01', '', NULL, '', 179, 0.00, 0.00, 0.00, 0.00),
('Acmad Joohar M/d', 8345.56, 'አህመድ ጆሀር መሀመድ', '341/01/01', '', NULL, '', 180, 0.00, 0.00, 0.00, 0.00),
('Qali Cuseen Ibraahim', 8345.56, 'አሊ ሁሴን ኢብራሂም', '341/01/01', '', NULL, '', 181, 0.00, 0.00, 0.00, 0.00),
('Birihanuu Haylu Bayene', 8345.56, 'ብርሀኑ ኃይሉ', '341/01/01', '', NULL, '', 182, 0.00, 0.00, 0.00, 0.00),
('Abaaba Tsagaye', 8186.88, 'አበባ ጸጋየ', '341/01/01', '', NULL, '', 183, 0.00, 0.00, 0.00, 0.00),
('Abubeker Qabdu', 8345.56, 'አቡበከር አብዱ', '341/01/01', '', NULL, '', 184, 0.00, 0.00, 0.00, 0.00),
('Indris Casaan Yaqidi', 7863.10, 'እንድስ ሀሰን ያኢዲ', '341/01/01', '', NULL, '', 185, 0.00, 0.00, 0.00, 0.00),
('Awwal Saddik Macammad', 7863.10, 'አዉል ሰዲቅ መሀመድ', '341/01/01', '', NULL, '', 186, 0.00, 0.00, 0.00, 0.00),
('Radiya Acmad Macammad', 7714.62, 'ራዲያ አህመድ መሀመድ', '341/01/01', '', NULL, '', 187, 0.00, 0.00, 0.00, 0.00),
('Saqada Macammad Gura', 7714.62, 'ሰአዳ መሀመድ ጉራ', '341/01/01', '', NULL, '', 188, 0.00, 0.00, 0.00, 0.00),
('Cayat Habib', 7714.62, 'ሃያት ሀቢብ', '341/01/01', '', NULL, '', 189, 0.00, 0.00, 0.00, 0.00),
('Cayaat Acmad', 7714.62, 'ሀያት አህመድ እንድርስ', '341/01/01', '', NULL, '', 190, 0.00, 0.00, 0.00, 0.00),
('Toyba Qabdu Wassiq', 5747.62, 'ጦባ አብዱ ዋሰዕ', '341/01/01', '', NULL, '', 191, 0.00, 0.00, 0.00, 0.00),
('Qali Qusman Maqar', 7863.10, 'አሊ ኡስማን መዓር', '341/01/01', '', NULL, '', 192, 0.00, 0.00, 0.00, 0.00),
('Saqid Macammad Musa', 7416.12, 'ሰኢድ መሀመድ ሙሳ', '341/01/01', '', NULL, '', 193, 0.00, 0.00, 0.00, 0.00),
('Qusman Qali Macammad', 7416.12, 'ኡስማን አሊ መሀመድ', '341/01/01', '', NULL, '', 194, 0.00, 0.00, 0.00, 0.00),
('Siraji Ediris', 7416.12, 'ሲራጅ ኢድሪስ ኢነይቱ', '341/01/01', '', NULL, '', 195, 0.00, 0.00, 0.00, 0.00),
('Zikra Megos', 7277.32, 'ዚክራ ሞገስ', '341/01/01', '', NULL, '', 196, 0.00, 0.00, 0.00, 0.00),
('Casana macammad Bolkoq', 7277.32, 'ሀስና መሀመድ ቦልኮዕ', '341/01/01', '', NULL, '', 197, 0.00, 0.00, 0.00, 0.00),
('Farhya Macammad Mullat', 7277.32, 'ፈርህያ መሀመድ ሙላት', '341/01/01', '', NULL, '', 198, 0.00, 0.00, 0.00, 0.00),
('Cayaat Kabbexe', 7277.32, 'ሀያት ከበደ', '341/01/01', '', NULL, '', 199, 0.00, 0.00, 0.00, 0.00),
('Usman Cussen qali', 7416.12, 'ኡስማን ሁሴን አሊ', '341/01/01', '', NULL, '', 200, 0.00, 0.00, 0.00, 0.00),
('Momina Reshid', 7277.32, 'ሞሚና ረሽድ', '341/01/01', '', NULL, '', 201, 0.00, 0.00, 0.00, 0.00),
('Macamad Naasir', 6962.03, 'መሀመድ ናስር ኦጎልስ', '341/01/01', '', NULL, '', 202, 0.00, 0.00, 0.00, 0.00),
('Casan Macammad', 6962.03, 'ሀሰን መሀመድ አህመድ', '341/01/01', '', NULL, '', 203, 0.00, 0.00, 0.00, 0.00),
('Fatuma Maace Qali', 6832.33, 'ፈጡማ ማሄ አሊ', '341/01/01', '', NULL, '', 204, 0.00, 0.00, 0.00, 0.00),
('Indris Acmad Qali', 6962.03, 'ኢንድሪስ አህመድ አሊ', '341/01/01', '', NULL, '', 205, 0.00, 0.00, 0.00, 0.00),
('Qali Macammad', 6962.03, 'አሊ መሀመድ', '341/01/01', '', NULL, '', 206, 0.00, 0.00, 0.00, 0.00),
('Macammad Casan', 6535.88, 'መሀመድ ሀሰን', '341/01/01', '', NULL, '', 207, 0.00, 0.00, 0.00, 0.00),
('Grima Aragewi Desta', 6535.88, 'ግርማ አራጋዊ ድስታ', '341/01/01', '', NULL, '', 208, 0.00, 0.00, 0.00, 0.00),
('Macammad Saqid', 6535.88, 'መሀመድ ሰኢድ አሊ', '341/01/01', '', NULL, '', 209, 0.00, 0.00, 0.00, 0.00),
('Macammad Qali Rashid', 6535.88, 'መሀመድ አሊ ራሽድ', '341/01/01', '', NULL, '', 210, 0.00, 0.00, 0.00, 0.00),
('Waliyuu Macammad', 6535.88, 'ወልዩ መሀመድ', '341/01/01', '', NULL, '', 211, 0.00, 0.00, 0.00, 0.00),
('Macammad Abubakar', 6535.88, 'መሀመድ አቡበከር', '341/01/01', '', NULL, '', 212, 0.00, 0.00, 0.00, 0.00),
('Acmad Macammad Hassan', 6535.88, 'አህመድ መሀመድ ሀሰን', '341/01/01', '', NULL, '', 213, 0.00, 0.00, 0.00, 0.00),
('Cabiib Qiise', 6535.88, 'ሀቢብ ኢሴ', '341/01/01', '', NULL, '', 214, 0.00, 0.00, 0.00, 0.00),
('MacammadAwall Qali', 6535.88, 'መሀመድ አዉል አሊ', '341/01/01', '', NULL, '', 215, 0.00, 0.00, 0.00, 0.00),
('Qabdu Adan Qisee', 6535.88, 'አብዱ አደን ኢሴ', '341/01/01', '', NULL, '', 216, 0.00, 0.00, 0.00, 0.00),
('Abuula Waadir Yammibule', 6535.88, 'አቡላ ዋደር የንቡሌ', '341/01/01', '', NULL, '', 217, 0.00, 0.00, 0.00, 0.00),
('Adan Qali', 6535.88, 'አደን አሊ', '341/01/01', '', NULL, '', 218, 0.00, 0.00, 0.00, 0.00),
('Kadir Acmad', 6535.88, 'ከድር አህመድ', '341/01/01', '', NULL, '', 219, 0.00, 0.00, 0.00, 0.00),
('Maqiruf Sheceem', 6535.88, 'ማእሩፍ ሸሂም', '341/01/01', '', NULL, '', 220, 0.00, 0.00, 0.00, 0.00),
('Macammad Awwal', 6535.88, 'መሀመድ አወል', '341/01/01', '', NULL, '', 221, 0.00, 0.00, 0.00, 0.00),
('Qabdu Haftam M/d', 6535.88, 'አብዱ ሀፍታሙ መሀመድ', '341/01/01', '', NULL, '', 222, 0.00, 0.00, 0.00, 0.00),
('Hawwa Acmad M/d', 6414.72, 'ሀዋ አህመድ መሀመድ', '341/01/01', '', NULL, '', 223, 0.00, 0.00, 0.00, 0.00),
('Qumar Saqad', 6535.88, 'ኡመር ሰአድ', '341/01/01', '', NULL, '', 224, 0.00, 0.00, 0.00, 0.00),
('Acmad Esmaqil Qali', 6535.88, 'አህመድ እስማዕል አሊ', '341/01/01', '', NULL, '', 225, 0.00, 0.00, 0.00, 0.00),
('Qabdu Qusman Salih', 6535.88, 'አብዱ ኡስማን ሳሊህ', '341/01/01', '', NULL, '', 226, 0.00, 0.00, 0.00, 0.00),
('Cuseen Macammad seid', 6535.88, 'ሁሴን መሀመድ ሰኢድ', '341/01/01', '', NULL, '', 227, 0.00, 0.00, 0.00, 0.00),
('Acmad Esmaqil M.d', 6535.88, 'አህመድ እስማዕል መሀመድ', '341/01/01', '', NULL, '', 228, 0.00, 0.00, 0.00, 0.00),
('Acmad Macammad', 6535.88, 'አህመድ መሀመድ', '341/01/01', '', NULL, '', 229, 0.00, 0.00, 0.00, 0.00),
('Macammad Qusma M/d', 6535.88, 'መሀመድ ኡስማን መሀመድ', '341/01/01', '', NULL, '', 230, 0.00, 0.00, 0.00, 0.00),
('Acmad Adam', 6535.88, 'አህመድ አደም ሁመድ', '341/01/01', '', NULL, '', 231, 0.00, 0.00, 0.00, 0.00),
('Calima Maace', 6414.72, 'ሀሊማ ማሄ አህመድ', '341/01/01', '', NULL, '', 232, 0.00, 0.00, 0.00, 0.00),
('Qabdusalam Mustafa', 6535.88, 'አብዱሰላም ሙስጠፋ', '341/01/01', '', NULL, '', 233, 0.00, 0.00, 0.00, 0.00),
('Awwal Abubakar', 6535.88, 'አዉል አቡበከር', '341/01/01', '', NULL, '', 234, 0.00, 0.00, 0.00, 0.00),
('Cabib Maace Biliqa', 6535.88, 'ሀቢብ ማሄ', '341/01/01', '', NULL, '', 235, 0.00, 0.00, 0.00, 0.00),
('Cayyu Qali Cayyu', 6535.88, 'ሃዩ አሊ ሃዩ', '341/01/01', '', NULL, '', 236, 0.00, 0.00, 0.00, 0.00),
('Tarrefe Getachewu', 6535.88, 'ተራፋ ገተቻዉ', '341/01/01', '', NULL, '', 237, 0.00, 0.00, 0.00, 0.00),
('Iremiyaas Giriima Tufaa', 6535.88, 'ኤርሚያስ ግርማ ቱፋ', '341/01/01', '', NULL, '', 238, 0.00, 0.00, 0.00, 0.00),
('Osaamadin Faqiz Qabdulwahab', 6535.88, 'ኦሳማዲን ፋዕዝ አብዱልዋብ', '341/01/01', '', NULL, '', 239, 0.00, 0.00, 0.00, 0.00),
('Ebrahim Camadu', 6535.88, 'ኢብራሂም ሃመዱ', '341/01/01', '', NULL, '', 240, 0.00, 0.00, 0.00, 0.00),
('Siraji Darasa Salic', 6535.88, 'ሲራጂ ደራሳ ሳልህ', '341/01/01', '', NULL, '', 241, 0.00, 0.00, 0.00, 0.00),
('Qabdalla Macammad Tayib', 6535.88, 'አብደላ መሀመድ ጠይብ', '341/01/01', '', NULL, '', 242, 0.00, 0.00, 0.00, 0.00),
('Macammad Cuseen Qali', 6535.88, 'መሀመድ ሁሴን አሊ', '341/01/01', '', NULL, '', 243, 0.00, 0.00, 0.00, 0.00),
('Qumar Macammad', 6535.88, 'ኡመር መሀመድ', '341/01/01', '', NULL, '', 244, 0.00, 0.00, 0.00, 0.00),
('Cummad Aden qali', 6535.88, 'ሁመድ አደን አሊ', '341/01/01', '', NULL, '', 245, 0.00, 0.00, 0.00, 0.00),
('Amin Nakrusa', 6535.88, 'አሚን ናክሩሳ', '341/01/01', '', NULL, '', 246, 0.00, 0.00, 0.00, 0.00),
('Darasa Ebraahim', 6535.88, 'ደራሰ እብራሂም', '341/01/01', '', NULL, '', 247, 0.00, 0.00, 0.00, 0.00),
('Kedir Macammad', 6535.88, 'ከድር መሀመድ', '341/01/01', '', NULL, '', 248, 0.00, 0.00, 0.00, 0.00),
('Acmed Qalibara', 6535.88, 'አህመድ አሊበራ', '341/01/01', '', NULL, '', 249, 0.00, 0.00, 0.00, 0.00),
('Macammad Awwal balet', 6535.88, 'መሀመድ አወል በለጠ', '341/01/01', '', NULL, '', 250, 0.00, 0.00, 0.00, 0.00),
('Adam Qali Cuseen', 6535.88, 'አደም አሊ ሁሴን', '341/01/01', '', NULL, '', 251, 0.00, 0.00, 0.00, 0.00),
('Macammad Qudum', 6535.88, 'መሀመድ ኡዱም', '341/01/01', '', NULL, '', 252, 0.00, 0.00, 0.00, 0.00),
('Acmad Mogola', 6535.88, 'አህመድ ሞጎላ', '341/01/01', '', NULL, '', 253, 0.00, 0.00, 0.00, 0.00),
('Qabdalla Qabdulkadier', 6535.88, 'አብደላ አብዱልቃድር', '341/01/01', '', NULL, '', 254, 0.00, 0.00, 0.00, 0.00),
('Ebirahim Ouseman', 6535.88, 'ኢብራሂም ኡስማን', '341/01/01', '', NULL, '', 255, 0.00, 0.00, 0.00, 0.00),
('Amin Irisa', 6535.88, 'አሚን ኢርሳ', '341/01/01', '', NULL, '', 256, 0.00, 0.00, 0.00, 0.00),
('Shawaaye Kiroos', 6414.72, 'ሸዋዬ ኪሮስ', '341/01/01', '', NULL, '', 257, 0.00, 0.00, 0.00, 0.00),
('Aydaacis Macammad', 6535.88, 'አይደሂስ መሀመድ አዉል', '341/01/01', '', NULL, '', 258, 0.00, 0.00, 0.00, 0.00),
('Qabdu Macolad', 5594.00, 'አብዱ መኮለድ', '341/01/01', '', NULL, '', 259, 0.00, 0.00, 0.00, 0.00),
('Egaa Cammad Calaato', 5594.00, 'ኢጋ ሀመድ ሀለቶ', '341/01/01', '', NULL, '', 260, 0.00, 0.00, 0.00, 0.00),
('Gaddo Cummad', 5594.00, 'ገዶ ሁመድ ሉባ', '341/01/01', '', NULL, '', 261, 0.00, 0.00, 0.00, 0.00),
('Cammad Qali m/d', 5594.00, 'ሀመድ አሊ መሀመድ', '341/01/01', '', NULL, '', 262, 0.00, 0.00, 0.00, 0.00),
('Casna Cummad Qali', 5542.96, 'ሀስና ሁመድ አሊ', '341/01/01', '', NULL, '', 263, 0.00, 0.00, 0.00, 0.00),
('Mayiiram Acmad', 5542.96, 'መይረም አህመድ', '341/01/01', '', NULL, '', 264, 0.00, 0.00, 0.00, 0.00),
('Qabdukadir Cammad', 5594.00, 'አብዱቀድር ሀመድ', '341/01/01', '', NULL, '', 265, 0.00, 0.00, 0.00, 0.00),
('Lubaa Cummad Uddaytu', 5594.00, 'ሉበ ሁመድ ኡደይቱ', '341/01/01', '', NULL, '', 266, 0.00, 0.00, 0.00, 0.00),
('Buzuunesh Asrat', 5542.96, 'ብዙነሽ አስረት', '341/01/01', '', NULL, '', 267, 0.00, 0.00, 0.00, 0.00),
('Macammad Qabdu Cuseen', 5594.00, 'መሀመድ አብዱ ሁሴን', '341/01/01', '', NULL, '', 268, 0.00, 0.00, 0.00, 0.00),
('Macammad Acmad Ega', 5594.00, 'መሀመድ አህመድ ኢጋ', '341/01/01', '', NULL, '', 269, 0.00, 0.00, 0.00, 0.00),
('Kadir Macammad Bitiqa', 5594.00, 'ከድር መሀመድ ቢትኣ', '341/01/01', '', NULL, '', 270, 0.00, 0.00, 0.00, 0.00),
('Tooyb Aytiile', 5594.00, 'ጦይብ አይትሌ', '341/01/01', '', NULL, '', 271, 0.00, 0.00, 0.00, 0.00),
('Musaa Cummad Ibraahim', 5594.00, 'ሙሳ ሁመድ እብራሂም', '341/01/01', '', NULL, '', 272, 0.00, 0.00, 0.00, 0.00),
('Qabdu Qali Cummad', 5594.00, 'አብዱ አሊ ሁመድ', '341/01/01', '', NULL, '', 273, 0.00, 0.00, 0.00, 0.00),
('Salic Maqar Qali', 5594.00, 'ሷሊህ መዓር አሊ', '341/01/01', '', NULL, '', 274, 0.00, 0.00, 0.00, 0.00),
('Macammad Haarun M/d', 5594.00, 'መሀመድ ሃሩን መሀመድ', '341/01/01', '', NULL, '', 275, 0.00, 0.00, 0.00, 0.00),
('Cammad Noor', 5594.00, 'አህመድ ኑር', '341/01/01', '', NULL, '', 276, 0.00, 0.00, 0.00, 0.00),
('Qiise Qali', 5594.00, 'ኢሴ አሊ', '341/01/01', '', NULL, '', 277, 0.00, 0.00, 0.00, 0.00),
('Gaddo Qabdu Casan', 5594.00, 'ገዶ አብዱ ሀሰን', '341/01/01', '', NULL, '', 278, 0.00, 0.00, 0.00, 0.00),
('Qabdu Macammad', 5594.00, 'አብዱ መሀመድ', '341/01/01', '', NULL, '', 279, 0.00, 0.00, 0.00, 0.00),
('Qiise Macammad', 5594.00, 'ኢሴ መሀመድ', '341/01/01', '', NULL, '', 280, 0.00, 0.00, 0.00, 0.00),
('Toybi Awwal', 5594.00, 'ጦይብ አወል', '341/01/01', '', NULL, '', 281, 0.00, 0.00, 0.00, 0.00),
('Fatuuma Edris', 5542.96, 'ፈጡማ እደሪስ', '341/01/01', '', NULL, '', 282, 0.00, 0.00, 0.00, 0.00),
('lakkiqo Cuseen', 4952.96, 'ለኪኦ ሁሴን', '341/01/01', '', NULL, '', 283, 0.00, 0.00, 0.00, 0.00),
('Laali Qalo qali', 5542.96, 'ላሊ አሎ አሊ', '341/01/01', '', NULL, '', 284, 0.00, 0.00, 0.00, 0.00),
('Macammad Cassan Cuseen', 5594.00, 'መሀመድ ሀሰን ሁሴን', '341/01/01', '', NULL, '', 285, 0.00, 0.00, 0.00, 0.00),
('Qali cajji keero', 5594.00, 'አሊ ሀጂ ኬሮ', '341/01/01', '', NULL, '', 286, 0.00, 0.00, 0.00, 0.00),
('Cabo Qali Awall', 5542.96, 'ሀቦ አሊ አዉል', '341/01/01', '', NULL, '', 287, 0.00, 0.00, 0.00, 0.00),
('Yeeshi Macammad', 5542.96, 'የሺ መሀመድ', '341/01/01', '', NULL, '', 288, 0.00, 0.00, 0.00, 0.00),
('Aysha Qali Macammad', 5542.96, 'አይሻ አሊ መሀመድ', '341/01/01', '', NULL, '', 289, 0.00, 0.00, 0.00, 0.00),
('Qali Adan Cummad', 5594.00, 'አሊ አደን ሁመድ', '341/01/01', '', NULL, '', 290, 0.00, 0.00, 0.00, 0.00),
('Macammad Sherif Ebraahim', 5594.00, 'መሀመድ ሸሪፍ', '341/01/01', '', NULL, '', 291, 0.00, 0.00, 0.00, 0.00),
('Habib Macammed', 5594.00, 'ሀቢብ መሀመድ', '341/01/01', '', NULL, '', 292, 0.00, 0.00, 0.00, 0.00),
('Haawa Saqid', 5542.96, 'ሃዋ ሰይድ', '341/01/01', '', NULL, '', 293, 0.00, 0.00, 0.00, 0.00),
('Qumar Cummad Qali', 5594.00, 'ኡመር ሁመድ አሊ', '341/01/01', '', NULL, '', 294, 0.00, 0.00, 0.00, 0.00),
('Momina Maace Yayyo', 5542.96, 'ሞሚና ማሄ ያዮ', '341/01/01', '', NULL, '', 295, 0.00, 0.00, 0.00, 0.00),
('Tiruuwark Balawu', 5542.96, 'ጥሩወርቅ በለዉ', '341/01/01', '', NULL, '', 296, 0.00, 0.00, 0.00, 0.00),
('Saara Qabdu', 5542.96, 'ሣራ አብዱ', '341/01/01', '', NULL, '', 297, 0.00, 0.00, 0.00, 0.00),
('Quddima Qali Macammad', 5542.96, 'ኡድማ አሊ መሀመድ', '341/01/01', '', NULL, '', 298, 0.00, 0.00, 0.00, 0.00),
('Madinaa Macammad Qali', 5542.96, 'መድና መሀመድ አሊ', '341/01/01', '', NULL, '', 299, 0.00, 0.00, 0.00, 0.00),
('Hawwi Xogga M/d', 5542.96, 'ሃዊ ዶጋ መሀመድ', '341/01/01', '', NULL, '', 300, 0.00, 0.00, 0.00, 0.00),
('Caliima Qali Hmmad', 5542.96, 'ሀሊማ አሊ ሀመድ', '341/01/01', '', NULL, '', 301, 0.00, 0.00, 0.00, 0.00),
('Calimaa Badisaa Qali', 5542.96, 'ሀሊማ በዲሳ አሊ', '341/01/01', '', NULL, '', 302, 0.00, 0.00, 0.00, 0.00),
('Amiina Yaasin Macammad', 5542.96, 'አሚና ያሲን መሀመድ', '341/01/01', '', NULL, '', 303, 0.00, 0.00, 0.00, 0.00),
('Qeyisa Kaloyta', 5542.96, 'ኤይሳ ከሎይታ', '341/01/01', '', NULL, '', 304, 0.00, 0.00, 0.00, 0.00),
('Mayraam Canfare', 5542.96, 'መይረም ሀንፈሬ', '341/01/01', '', NULL, '', 305, 0.00, 0.00, 0.00, 0.00),
('Qarabi kadir M/d', 5542.96, 'ወ.ሮ አራቢ ከድር መሀመድ', '341/01/01', '', NULL, '', 306, 0.00, 0.00, 0.00, 0.00),
('Mayram Yasin Qali', 5542.96, 'መይራም ያሲን አሊ', '341/01/01', '', NULL, '', 307, 0.00, 0.00, 0.00, 0.00),
('Aysha Maace Qali', 5542.96, 'አይሳ ማሄ አሊ', '341/01/01', '', NULL, '', 308, 0.00, 0.00, 0.00, 0.00),
('Hawwa Macammad', 5542.96, 'ሃዋ መሀመድ ቡረሃን', '341/01/01', '', NULL, '', 309, 0.00, 0.00, 0.00, 0.00),
('Fatuma Zanab Kuni', 5542.96, 'ፈጡማ ዘናብ ኩኒ', '341/01/01', '', NULL, '', 310, 0.00, 0.00, 0.00, 0.00),
('Hawa Dawud', 5542.96, 'ሀዋ ደዉድ', '341/01/01', '', NULL, '', 311, 0.00, 0.00, 0.00, 0.00),
('Mayrem Qali Yusuf', 5542.96, 'መይራም አሊ ዩሱፍ', '341/01/01', '', NULL, '', 312, 0.00, 0.00, 0.00, 0.00),
('Amina Qabdu Musa', 5542.96, 'አሚና አብዱ ሙሳ', '341/01/01', '', NULL, '', 313, 0.00, 0.00, 0.00, 0.00),
('Cadi Macammad', 5542.96, 'ሀዲ መሀመድ', '341/01/01', '', NULL, '', 314, 0.00, 0.00, 0.00, 0.00),
('cadi Gaqas Macammad', 5542.96, 'ሀዲ ገአስ መሀመድ', '341/01/01', '', NULL, '', 315, 0.00, 0.00, 0.00, 0.00),
('Cummad Macammad Xokkba', 5594.00, 'ሁመድ መሀመድ ዶክባ', '341/01/01', '', NULL, '', 316, 0.00, 0.00, 0.00, 0.00),
('Acmad Nuru', 5259.52, 'አህመድ ኑሩ', '341/01/01', '', NULL, '', 317, 0.00, 0.00, 0.00, 0.00),
('Qabdalla Kotiina Acmad', 5259.52, 'አብደላ ኮቲና አህመድ', '341/01/01', '', NULL, '', 318, 0.00, 0.00, 0.00, 0.00),
('Toyba Macammad', 5211.92, 'ጦይባ መሀመድ', '341/01/01', '', NULL, '', 319, 0.00, 0.00, 0.00, 0.00),
('Nur Canfaare', 5259.52, 'ኑር ሀንፋሬ', '341/01/01', '', NULL, '', 320, 0.00, 0.00, 0.00, 0.00),
('Wasaakmali Qali', 5211.92, 'ወሰክመል አሊ', '341/01/01', '', NULL, '', 321, 0.00, 0.00, 0.00, 0.00),
('Fatuma Sadik', 5211.92, 'ፋጡማ ሰዲቅ', '341/01/01', '', NULL, '', 322, 0.00, 0.00, 0.00, 0.00),
('Fatuma Yayyo', 5211.92, 'ፋጡማ ያዮ', '341/01/01', '', NULL, '', 323, 0.00, 0.00, 0.00, 0.00),
('Qaysa Dulla', 4397.10, 'አይሳ ዱላ', '341/01/01', '', NULL, '', 324, 0.00, 0.00, 0.00, 0.00),
('Safi Acmad', 3245.74, 'ሳፊ አህመድ', '341/01/01', '', NULL, '', 325, 0.00, 0.00, 0.00, 0.00),
('Mubark Edris', 3245.74, 'ሙባረክ እንድሪስ', '341/01/01', '', NULL, '', 326, 0.00, 0.00, 0.00, 0.00),
('Macammed Acmad Macammed', 3245.74, 'መሀመድ አህመድ መሀመድ', '341/01/01', '', NULL, '', 327, 0.00, 0.00, 0.00, 0.00),
('Macammed Ibrahim', 3245.74, 'መሀመድ ኢብራሂም', '341/01/01', '', NULL, '', 328, 0.00, 0.00, 0.00, 0.00),
('Edris Siraaj', 3245.74, 'እንድሪስ ሲራጅ', '341/01/01', '', NULL, '', 329, 0.00, 0.00, 0.00, 0.00),
('Amina Amin', 1699.60, 'አሚና አሚን ኢብራሂም', '341/01/01', '', NULL, '', 330, 0.00, 0.00, 0.00, 0.00),
('A', 13000.00, 'ሀ', 'Engineer', 'የእቅድ ዝግጅት፣ ክትትልና ግምገማ  ዳይሬክቶሬት', NULL, '2025-10-17', 331, 0.00, 0.00, 0.00, 0.00);

-- --------------------------------------------------------

--
-- Table structure for table `fuel_transactions`
--

CREATE TABLE `fuel_transactions` (
  `id` int(11) NOT NULL,
  `budget_type` enum('governmental','program') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'governmental',
  `owner_id` int(11) DEFAULT NULL,
  `p_koox` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `driver_name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `plate_number` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `et_month` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `previous_gauge` decimal(10,2) DEFAULT NULL,
  `current_gauge` decimal(10,2) DEFAULT NULL,
  `journey_distance` decimal(10,2) DEFAULT NULL,
  `fuel_price` decimal(10,2) DEFAULT NULL,
  `refuelable_amount` decimal(10,2) DEFAULT NULL,
  `total_amount` decimal(15,2) DEFAULT NULL,
  `new_gauge` decimal(10,2) DEFAULT NULL,
  `gauge_gap` decimal(10,2) DEFAULT NULL,
  `date` datetime DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `fuel_transactions`
--

INSERT INTO `fuel_transactions` (`id`, `budget_type`, `owner_id`, `p_koox`, `driver_name`, `plate_number`, `et_month`, `previous_gauge`, `current_gauge`, `journey_distance`, `fuel_price`, `refuelable_amount`, `total_amount`, `new_gauge`, `gauge_gap`, `date`) VALUES
(62, 'program', 31, NULL, 'aaa', '4-00903 AF', '', 0.00, 0.00, 250.00, 117.30, 50.00, 5865.00, 250.00, 250.00, '2025-09-29 15:57:13'),
(63, 'program', 43, NULL, 'Driver1', '4-00909 AF', '', 0.00, 10000.00, 250.00, 120.94, 50.00, 6047.00, 10250.00, 250.00, '2025-09-30 21:19:15'),
(64, 'program', 43, NULL, 'aa', '4-00471 AF', '', 0.00, 0.00, 250.00, 120.94, 50.00, 6047.00, 250.00, 250.00, '2025-10-09 00:34:54'),
(65, 'program', 30, NULL, 'bb', '4-00907 AF', '', 250.00, 250.00, 200.00, 120.94, 40.00, 4837.60, 450.00, 200.00, '2025-10-09 00:58:04'),
(66, 'program', 30, NULL, 'jnn', '4-00903 AF', '', 0.00, 250.00, 100.00, 120.94, 0.00, 0.00, 0.00, 0.00, '2025-10-09 03:09:29'),
(67, 'program', 30, NULL, 'app', '4-00907 AF', '', 450.00, 450.00, 250.00, 120.94, 50.00, 6047.00, 700.00, 0.00, '2025-10-09 22:45:55'),
(68, 'program', 30, NULL, 'abebe', '4-00907 AF', '', 700.00, 750.00, 1033.57, 120.94, 206.71, 25000.00, 1783.57, 50.00, '2025-10-09 22:54:01'),
(69, 'program', 30, NULL, 'mr driver1', '4-00907 AF', '', 1783.57, 1790.00, 620.14, 120.94, 124.03, 15000.00, 2410.14, 6.43, '2025-10-10 02:07:07'),
(70, 'program', 30, NULL, 'abc', '4-00907 AF', '', 2410.14, 2411.00, 50.00, 120.94, 10.00, 1209.40, 2461.00, 0.86, '2025-10-10 06:12:05'),
(72, 'governmental', 5, '341/01/01', 'rr', '4-00471 AF', 'መስከረም', 663.43, 663.43, 2894.00, 120.94, 578.80, 70000.00, 3557.43, 0.00, '2025-10-11 03:08:09'),
(73, 'governmental', 5, '341/01/01', 'rr', '4-00471 AF', 'መስከረም', 3557.43, 3557.43, 413.43, 120.94, 82.69, 10000.00, 3970.86, 0.00, '2025-10-11 03:09:54'),
(74, 'governmental', 6, '341/01/01', 'a', '4-00471 AF', 'መስከረም', 3970.86, 3970.86, 41.34, 120.94, 8.27, 1000.00, 4012.20, 0.00, '2025-10-12 22:52:46');

-- --------------------------------------------------------

--
-- Table structure for table `perdium_transactions`
--

CREATE TABLE `perdium_transactions` (
  `id` int(11) NOT NULL,
  `budget_type` enum('governmental','program') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'governmental',
  `employee_id` int(11) NOT NULL,
  `budget_owner_id` int(11) NOT NULL,
  `p_koox` varchar(25) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `budget_code_id` int(11) DEFAULT NULL,
  `city_id` int(11) NOT NULL,
  `perdium_rate` decimal(10,2) NOT NULL,
  `total_days` int(11) NOT NULL,
  `departure_date` date NOT NULL,
  `arrival_date` date NOT NULL,
  `total_amount` decimal(10,2) NOT NULL,
  `et_month` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `perdium_transactions`
--

INSERT INTO `perdium_transactions` (`id`, `budget_type`, `employee_id`, `budget_owner_id`, `p_koox`, `budget_code_id`, `city_id`, `perdium_rate`, `total_days`, `departure_date`, `arrival_date`, `total_amount`, `et_month`, `created_at`) VALUES
(1, 'program', 331, 38, NULL, 6, 28, 1752.40, 5, '2025-10-18', '2025-10-22', 7622.94, '', '2025-10-17 20:59:09');

-- --------------------------------------------------------

--
-- Table structure for table `vehicles`
--

CREATE TABLE `vehicles` (
  `id` int(11) NOT NULL,
  `model` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `plate_no` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `chassis_no` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `vehicles`
--

INSERT INTO `vehicles` (`id`, `model`, `plate_no`, `chassis_no`) VALUES
(1, 'ሀይሎክስ', '4-01265', 'AHTKB8CD60298739'),
(2, 'ሀይሎክስ', '4-01264', 'AHTKB8CD302987832'),
(3, 'ሀይሎ ክች', '4-01263 AF', 'AHTKB8CD702987834'),
(4, 'ሀይሎክስ', '4-01274 AF', NULL),
(5, 'ሀይሎክስ', '4-01275 AF', NULL),
(6, 'ሀይሎክስ', '4-01203', NULL),
(7, 'ሀይሎክስ', '4-01283 AF', 'JTEEB71J30F029582'),
(8, 'ሀይሎክስ', '4-01198 AF', 'JTEEB71J6014901'),
(9, 'ሀይሎክስ', '4-00471 AF', NULL),
(10, 'ሀይሎክስ', '4-1237 AF', 'JTEEB71J30F02648'),
(11, 'ላንድክሩዘር', '4-1238 AF', 'JTEEB71J0F026485'),
(12, 'ሃይሎክች', '4-01066 AF', 'JTRB71j00F006200'),
(13, 'ላንድክሩዘር', '4-01299 AF', 'AHTFR22G006106874'),
(14, ' ', '4-01302 AF', 'JTEBH9FJ80K198638'),
(15, 'ላንድክሩዘር', '4-01301 AF', 'JTEEB71J9041570'),
(16, ' ', '4-01184 AF', 'AHTKB8CD702984139'),
(17, 'ላንድክሩዘር', '4-01250 AF', 'JTEEB71J30F024351'),
(18, ' ', '4-01248 AF', 'JTEEB71J00F024291'),
(19, 'ላንድክሩዘር', '4-01249 AF', 'JTEEB71J70F024322'),
(20, 'አምቡላንስ', '4-01068 AF', 'JTERB71J70F004847'),
(21, 'አምቡላንስ', '4-01065 AF', 'JTERB71J20F005145'),
(22, ' ', '4-01303', NULL),
(23, 'ሃርድቶፕ', '4-01247 AF', 'JTEEB71J60F024294'),
(24, 'ሃርድቶፕ', '4-01246 AF', 'JTEEB71J70F024319'),
(25, 'ሃርድቶፕ', '4-01245 AF', 'JTEEB71J30F024317'),
(26, 'ሃርድቶፕ', '4-01244 AF', 'JTEEB71J30F024298'),
(27, 'ሃርድቶፕ', '4-01243 AF', 'JTEEB71J00F024324'),
(28, 'ሃርድቶፕ', '4-01241 AF', 'JTEEB7160F024313'),
(29, 'ሃርድቶፕ', '4-01242 AF', 'JTEEB71J10F024350'),
(30, 'ሃርድቶፕ', '4-01203 AF', 'JTEEB71J00F018018524'),
(31, 'ሃርድቶፕ', '4-00910 AF', 'JTEEB71J607040487'),
(32, 'ሃርድቶፕ', '4-00912 AF', 'JTEEB71J507040562'),
(33, 'ላንድክሩዘር', '4-05621', 'JTEEB71J907031119'),
(34, 'ቶያታ ሃርድቶፕ', '4-32792', 'JTEEB71J0014550'),
(35, 'ቶያታ ሃርድቶፕ', '4-01259 AF', 'JTERB71X0F024221'),
(36, 'ሃርድቶፕ', '4-00903 AF', 'JTEEB71J307043198'),
(37, 'ሃርድቶፕ', '4-00909 AF', 'JTEEB71J507040559'),
(38, 'ሃርድቶፕ', '4-00906 AF', 'JTEEB71307043220'),
(39, 'ሃርድቶፕ', '4-00908 AF', 'JTEEB71J507040643'),
(40, 'ሃርድቶፕ', '4-00911 AF', 'JTEEB71J607040540'),
(41, 'ሃርድቶፕ', '4-00904 AF', 'JTEEB7J307043248'),
(42, 'ሃርድቶፕ', '4-00907 AF', 'JTEEB71J507043199'),
(43, 'ሃርድቶፕ', '4-00905 AF', 'JTEEB71507043168'),
(44, 'ሃርድቶፕ', '4-00902 AF', 'JTEEB71J407043226'),
(45, 'ላንድክሩዘር', '4-17719 ET', ''),
(48, 'TATA Service Bus', '4-1234567', ''),
(49, 'A', '4-12345', '123456789');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `budgets`
--
ALTER TABLE `budgets`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_budget_entry` (`owner_id`,`code_id`,`year`,`month`),
  ADD KEY `idx_owner_code` (`owner_id`,`code_id`),
  ADD KEY `idx_budgets_owner_code_year_ecmonth` (`owner_id`,`code_id`,`year`,`ec_month`),
  ADD KEY `indx_budgets_owner_year_yearly` (`owner_id`,`year`,`monthly_amount`);

--
-- Indexes for table `emp_list`
--
ALTER TABLE `emp_list`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `fuel_transactions`
--
ALTER TABLE `fuel_transactions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `owner_id` (`owner_id`);

--
-- Indexes for table `perdium_transactions`
--
ALTER TABLE `perdium_transactions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `budget_code_id` (`budget_code_id`),
  ADD KEY `city_id` (`city_id`),
  ADD KEY `idx_perdium_owner_month` (`budget_owner_id`,`et_month`),
  ADD KEY `idx_perdium_employee` (`employee_id`),
  ADD KEY `idx_perdium_type_created` (`budget_type`,`created_at`);

--
-- Indexes for table `vehicles`
--
ALTER TABLE `vehicles`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `budgets`
--
ALTER TABLE `budgets`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `emp_list`
--
ALTER TABLE `emp_list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=332;

--
-- AUTO_INCREMENT for table `fuel_transactions`
--
ALTER TABLE `fuel_transactions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=75;

--
-- AUTO_INCREMENT for table `perdium_transactions`
--
ALTER TABLE `perdium_transactions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `vehicles`
--
ALTER TABLE `vehicles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
